9/data/attachments/143acdb4a04aeb5e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jessica_teach_Friend_49209_0</nif:username>
            <nif:friendToBeRequested>soap_friends_cc45c340-44e2-4cca-b933-4a428ae8bc28</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>